{
  "subtitle": "Engenheiro de Software",
  "copyright": "2021 Israel Deorce - Todos os direitos reservados",
  "br": "Brasil",
  "button": {
    "about": "Sobre",
    "about_me": "Sobre Mim",
    "skills": "Habilidades",
    "experience": "Experiência",
    "contact": "Contato",
    "visit_my_blog": "Visite meu Blog",
    "resume": "Currículo"
  },
  "desc": {
    "about_1": "Olá, meu nome é Israel Doerce, sou Engenheiro de Software e especialista em desenvolvimento web. Gosto do desafio de trabalhar com as melhores práticas sob condiçoes de incerteza para construir produtos de software de alta qualidade que afetem positivamente a vida das pessoas.",
    "about_2": "Graduado em Engenharia de Sotware pela PUCRS e com experiencia de trabalho em grandes empresas multinacionais, criei este site com o objetivo de apresentar o meu trabalho, compartilhar meu conhecimento e ajudar a comunidade de software a criar soluções de grande impacto na sociedade.",
    "personal_project": "Projeto Pessoal",
    "research_intern": "Estágio em P&D em parceria com a Dell Inc.",
    "intern": "(2018-2019) Ajudei a Dell a adotar uma nova metodologia baseada em Extreme Porgramming, Lean e User-Centered Design. Um livro guia surgiu desta parceria e isso também me ajudou a entrar para a Dell como Engenheiro",
    "hp": "(2020-Present) Trabalhando em maioria como um Engenheiro de Software de UI com React.js e Scrum Master em um time que cria e mantém a solução unificada da HP para credenciais e identidade de usuários para extensos grupos de produtos internacionais da HP",
    "dell": "(2019-2020) Trabalhei como um Engenheiro FUll Stack com React.js e .NET, desenvolvendo UI e microsserviços para os \"Serviços Financeiros da Dell\". Aqui, experimentei programação em pares, TDD e outras práticas ágeis de engenharia desenvolvidas durante o meu estágio",
    "ginatells": "(Em andamento) Um Projeto baseado em Inteligência Artificial que busca auxiliar usuários a acharem os melhores filmes ou coisas para assistirem baseado em seus gostos e sentimentos neste momento",
    "nonprofit_engineer": "Engenheiro de Software sem fins lucrativos (2016-2019)",
    "ages": "(2016-2019) A Agência Experimental de Engenharia de Software (AGES) deu-me a oportunidade de trabalhar em uma variedade de projetos como o Áudio Livros, Adoções, Simulados prova da OAB e \"EasyWork\"",
    "kpis": "(Em andamento) O projeto Software KPIs (indicador-chave de desempenho) é um projeto que visa facilitar a criação, implantação e gerenciamento de KPIs em times de desenvolvimento de software que seguem o pensamento Lean"
  },
  "skills": {
    "software_engineering": "Engenharia de Software",
    "agile": "Ágil",
    "xp": "XP",
    "sm": "Scrum",
    "git": "GIT",
    "ci_cd": "CI/CD",
    "lean": "Lean",
    "front": "Front-end",
    "html": "HTML",
    "css": "CSS",
    "react": "React.js",
    "javascript": "JavaScript",
    "back": "Back-end",
    "node": "Node.js",
    "c_sharp": "C#",
    "dotnet": ".NET 5",
    "java": "Java",
    "db": "Banco de Dados",    
    "sql": "MySQL",
    "oracle": "Oracle",
    "devops": "DevOps",
    "aws": "AWS",
    "ado": "Azure DevOps", 
    "automated_tests": "Testes Automatizados",
    "tdd": "TDD",
    "bdd": "BDD",
    "jest_enzyme": "Jest/Enzyme"
  }
}